Catalogs/ТипыПартнерскихБонусныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ТипыПартнерскихБонусныхКарт</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезлимитнаяУстановкаЛП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСимволовВНомере</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИсторияИзмененияРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияРеквизитов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеБыло</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтало</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатураСплитТестирования</v8:Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыПартнерскихБонусныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ТипыПартнерскихБонусныхКарт/Ext/ObjectModule.bsl
Перем ИсторияИзмененияРеквизитов; //+++АК ILIK 2018.07.19 ИП-00019030

//+++АК ILIK 2018.07.19 ИП-00019030
Процедура ПередЗаписью(Отказ)
	Если Не РольДоступна("ПолныеПрава")
	   И Не УправлениеДопПравамиПользователей.ПолучитьПравоПользователяУпр(ПланыВидовХарактеристик.ПраваПользователей.МожетРедактироватьТипыПартнерскихБонусныхКарт, Ложь) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав для записи элемента!", Отказ);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Отказ Тогда
		ИсторияИзмененияРеквизитов = Новый Структура;
		
		МассивПолейДляПроверкиИзменений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("Наименование,ПроцентСкидки,БезлимитнаяУстановкаЛП");
		Для Каждого ИмяПоляДляПроверкиИзменений Из МассивПолейДляПроверкиИзменений Цикл
			Если ЭтотОбъект[ИмяПоляДляПроверкиИзменений] <> Ссылка[ИмяПоляДляПроверкиИзменений] Тогда
				СтруктураИзменений = Новый Структура("ЗначениеБыло, ЗначениеСтало", Ссылка[ИмяПоляДляПроверкиИзменений], ЭтотОбъект[ИмяПоляДляПроверкиИзменений]);
				ИсторияИзмененияРеквизитов.Вставить(ИмяПоляДляПроверкиИзменений, СтруктураИзменений);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

//+++АК ILIK 2018.07.19 ИП-00019030
Процедура ПриЗаписи(Отказ)
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Отказ Тогда
		Для Каждого СтруктураИзменений Из ИсторияИзмененияРеквизитов Цикл
			ЗаписьРС = РегистрыСведений.ИсторияИзмененияРеквизитов.СоздатьМенеджерЗаписи();
			ЗаписьРС.Период = ТекущаяДата();
			ЗаписьРС.Ссылка = Ссылка;
			ЗаписьРС.ИмяРеквизита = СтруктураИзменений.Ключ;
			ЗаписьРС.Автор = ПараметрыСеанса.ТекущийПользователь;
			ЗаполнитьЗначенияСвойств(ЗаписьРС, СтруктураИзменений.Значение);
			ЗаписьРС.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
